
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic
  * module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic will be created
  + resource "azurerm_servicebus_topic" "servicebus_topic" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + enable_batched_operations               = false
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "stub-hmc-to-cft-aat"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat"
      + requires_duplicate_detection            = false
      + status                                  = "Active"
      + support_ordering                        = false
    }

  # module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
      + topic_id                          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":26,"Program":"tfcmt","SHA1":"","Vars":{}} -->